Конфигурация/DataProcessors/РабочееМестоКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоКассира</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеПоискаТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеПоискаТовара2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>				<Attribute>
					<Properties>
						<Name>МаркаСтатус</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>1</v8:Digits>
								<v8:FractionDigits>0</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Properties>
				</Attribute>				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>

			<TabularSection>
				<Properties>
					<Name>ЧекиККМ</Name>
				</Properties>
				<ChildObjects>
				<Attribute>
					<Properties>
						<Name>Касса</Name>
						<Type>
							<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						</Type>
					</Properties>
				</Attribute>
				<Attribute>
					<Properties>
						<Name>ЧекККМ</Name>
						<Type>
							<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						</Type>
					</Properties>
				</Attribute>
				<Attribute>
					<Properties>
						<Name>Сумма</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>15</v8:Digits>
								<v8:FractionDigits>2</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Properties>
				</Attribute>
				<Attribute>
					<Properties>
						<Name>СуммаСкидки</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>15</v8:Digits>
								<v8:FractionDigits>2</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Properties>
				</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФискальныеЧеки</Name>
				</Properties>
				<ChildObjects>
				<Attribute>
					<Properties>
						<Name>ВидОперации</Name>
						<Type>
							<v8:Type>cfg:EnumRef.ВидыОперацийФискальногоЧека</v8:Type>
						</Type>
					</Properties>
				</Attribute>
				<Attribute>
					<Properties>
						<Name>ФОП</Name>
						<Type>
							<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
						</Type>
					</Properties>
				</Attribute>
				<Attribute>
					<Properties>
						<Name>ФискальныйНомер</Name>
						<Type>
							<v8:Type>xs:string</v8:Type>
							<v8:StringQualifiers>
								<v8:Length>50</v8:Length>
							</v8:StringQualifiers>
						</Type>
					</Properties>
				</Attribute>
				<Attribute>
					<Properties>
						<Name>Сумма</Name>
						<Type>
							<v8:Type>xs:decimal</v8:Type>
							<v8:NumberQualifiers>
								<v8:Digits>15</v8:Digits>
								<v8:FractionDigits>2</v8:FractionDigits>
							</v8:NumberQualifiers>
						</Type>
					</Properties>
				</Attribute>
				<Attribute>
					<Properties>
						<Name>ФискальныйЧек</Name>
						<Type>
							<v8:Type>cfg:DocumentRef.ФискальныйЧек</v8:Type>
						</Type>
					</Properties>
				</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ВозвратТовараОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВозвратТовараОтПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальныйВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Кассы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКассы</Name>
					<Comment>Наличная или Банковский счет</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКасс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаПриРасчете</Name>
					<Comment>Отображать кассу при выборе оплаты в РМК</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/DataProcessors/РабочееМестоКассира/Forms/Форма/Ext/Form/Module.bsl
// =================================================================================
// МОДУЛЬ ФОРМЫ: РАБОЧЕЕ МЕСТО КАССИРА (РМК)
// Адаптация: Public_Trade_Module (Ukraine Edition)
// =================================================================================

&НаКлиенте
Перем ИмяКнопкиПоследнегоНажатия;

&НаКлиенте
Перем ТоварДляАкциза; // Для акцизных товаров с панели

&НаКлиенте
Перем ПоследнееАктивноеПоле; // Для пинг-понг активации полей сканера ("Поле1" или "Поле2")

//&НаСервере
//Перем КоличествоВРяду; // Количество кнопок в горизонтальном ряду

//&НаСервере
//Перем КоличествоРядов; // Количество кнопок в вертикальной колонке

//&НаСервере
//Перем ШиринаКнопок; // Ширина кнопок товаров в пиксели

//&НаСервере
//Перем ВысотаКнопок; // Высота кнопок товаров в пиксели

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// 0. Инициализация склада из настроек по умолчанию (оптимизация)
	ИнициализироватьСкладНаСервере();
	
	// 1. Инициализация и Проверка смены (Изменено)
	Если Не ПроверитьИПодключитьСмену() Тогда
		// Не блокируем открытие, а планируем вопрос пользователю
		ПодключитьОбработчикОжидания("ПредложитьОткрытьСмену", 0.1, Истина);
	КонецЕсли;
	
	// 2. Загружаем настройки панели один раз (оптимизация)
	ЗагрузитьНастройкиПанелиИзРегистра();
	
	// 3. Стандартная инициализация
	НомерСтраницыПараметр = 1;
	СоздатьГруппыРядов();
	ОбработчикУправлениеПанелиТоваров("ПриОткрытии");
	РежимОтображенияПанели();
	
	// 4. Инициализация режима работы - по умолчанию "Продажа"
	РежимРаботы = "Продажа";
	ОбновитьОтображениеРежима();
	
	// Инициализация псевдо драйвера сканера
	ПоследнееАктивноеПоле = "Поле1";
	АктивироватьПоиск();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Очистка не требуется, платформа удалит элементы автоматически.
	// Строку УдалитьГруппыРядов(); удаляем.
КонецПроцедуры
&НаКлиенте
Процедура ПредложитьОткрытьСмену()
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаНаОткрытиеСмены", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Кассовая смена не открыта. Открыть новую смену?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаОткрытиеСмены(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если СоздатьИПодключитьСменуНаСервере() Тогда
			ПоказатьПредупреждение(, "Смена успешно открыта!");
			АктивироватьПоиск();
		Иначе
			// Ошибка при создании - закрываемся
			Закрыть();
		КонецЕсли;
	Иначе
		// Пользователь отказался - закрываем РМК
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЛогикаКассовойСмены

&НаСервере
Функция ПроверитьИПодключитьСмену()
	
	// Ищем открытую смену
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КассоваяСмена.Ссылка КАК Смена,
		|	КассоваяСмена.Касса КАК Касса
		|ИЗ
		|	Документ.КассоваяСмена КАК КассоваяСмена
		|ГДЕ
		// ИСПРАВЛЕНО: Ссылка на правильное перечисление СтатусыКассовойСмены
		|	КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
		|	И НЕ КассоваяСмена.ПометкаУдаления";
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Объект.КассоваяСмена = Выборка.Смена;
	// Касса по умолчанию не устанавливается — используется выбранная при оплате
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СоздатьИПодключитьСменуНаСервере()
	
	// 1. Определяем кассу для новой смены
	// В реальном проекте: брали бы из настроек пользователя.
	// Здесь берем первую попавшуюся или основную.
	КассаДляСмены = Справочники.Кассы.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка КАК Ссылка ИЗ Справочник.Кассы ГДЕ НЕ ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КассаДляСмены = Выборка.Ссылка;
	КонецЕсли;
	
	Если КассаДляСмены.Пустая() Тогда
		Сообщить("Ошибка: В системе нет ни одной кассы!");
		Возврат Ложь;
	КонецЕсли;
	
	// 2. Создаем документ
	Попытка
		НоваяСмена = Документы.КассоваяСмена.СоздатьДокумент();
		НоваяСмена.Дата = ТекущаяДата();
		НоваяСмена.ДатаНачала = ТекущаяДата();
		НоваяСмена.Касса = КассаДляСмены; // Используем правильное имя реквизита
		НоваяСмена.Статус = Перечисления.СтатусыКассовойСмены.Открыта;
		
		НоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
		
		// 3. Подключаем к контексту формы
		Объект.КассоваяСмена = НоваяСмена.Ссылка;
		// Касса по умолчанию не устанавливается — используется выбранная при оплате
		
		Возврат Истина;
		
	Исключение
		Сообщить("Не удалось открыть смену: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции

&НаСервере
Функция ПроверитьИОткрытьСменуНаСервере()
	
	// Проверяем, есть ли открытая смена
	Если ПроверитьИПодключитьСмену() Тогда
		Возврат Истина;
	Иначе
		// Если нет открытой смены, создаем новую
		Возврат СоздатьИПодключитьСменуНаСервере();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗакрытьСменуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
		ВызватьИсключение "Нет активной смены для закрытия!";
	КонецЕсли;
	
	СменаОбъект = Объект.КассоваяСмена.ПолучитьОбъект();
	
	Если СменаОбъект = Неопределено Тогда
		ВызватьИсключение "Не удалось получить объект смены!";
	КонецЕсли;
	
	Если СменаОбъект.Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
		ВызватьИсключение "Смена уже закрыта!";
	КонецЕсли;
	
	СменаОбъект.ЗакрытьСмену();
	
	// Очищаем контекст РМК
	Объект.КассоваяСмена = Документы.КассоваяСмена.ПустаяСсылка();
	
КонецПроцедуры

#КонецОбласти

#Область СканированиеИПоиск

&НаКлиенте
Процедура АктивироватьПоиск(Команда = Неопределено)
	// Псевдо драйвер сканера: пинг-понг активация полей
	// Чередуем поля, чтобы избежать невозможности активации из собственного обработчика
	
	Если ПоследнееАктивноеПоле = "Поле1" Тогда
		// Предыдущим было Поле1 -> активируем Поле2
		Если Элементы.Найти("ПолеПоискаТовара2") <> Неопределено Тогда
			ТекущийЭлемент = Элементы.ПолеПоискаТовара2;
			ПоследнееАктивноеПоле = "Поле2";
		КонецЕсли;
	Иначе
		// Предыдущим было Поле2 -> активируем Поле1
		Если Элементы.Найти("ПолеПоискаТовара") <> Неопределено Тогда
			ТекущийЭлемент = Элементы.ПолеПоискаТовара;
			ПоследнееАктивноеПоле = "Поле1";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаТовараПриИзменении(Элемент)
	ПоследнееАктивноеПоле = "Поле1"; // Фиксируем источник
	ОбработкаШтрихкода(Объект.ПолеПоискаТовара);
	Объект.ПолеПоискаТовара = ""; 
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаТовара2ПриИзменении(Элемент)
	ОбработкаШтрихкода(Объект.ПолеПоискаТовара2);
	Объект.ПолеПоискаТовара2 = "";           
	ПоследнееАктивноеПоле = "Поле2"; // Фиксируем источник
	АктивироватьПоиск();
КонецПроцедуры

// --- ГЛОБАЛЬНЫЙ ПОИСК + АКЦИЗ ---

&НаКлиенте
Процедура ОбработкаШтрихкода(Штрихкод)
	Если ПустаяСтрока(Штрихкод) Тогда Возврат; КонецЕсли;
	
	// 1. Вызываем глобальный поиск (через Client wrapper)
	Оповещение = Новый ОписаниеОповещения("ОбработкаПоискаЗавершение", ЭтотОбъект, Штрихкод);
	ОбщегоНазначенияКлиент.НайтиИОбработатьТовар(Штрихкод, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПоискаЗавершение(Результат, Штрихкод) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		// 2. Проверяем, нужен ли акциз
		ПараметрыТовара = ПолучитьПараметрыТовараНаСервере(Результат);
		
		// Проверяем фискальный режим
		ФискальныйРежимВкл = ПолучитьФискальныйРежимНаСервере();
		
		// В режиме возврата или при выключенном фискальном режиме акцизные марки не запрашиваются
		Если ПараметрыТовара.ТребуетАкцизнуюМарку И РежимРаботы <> "Возврат" И ФискальныйРежимВкл Тогда
			// Запрашиваем ввод марки
			ДопПараметры = Новый Структура("Результат, Штрихкод", Результат, Штрихкод);
			ОповещениеМарки = Новый ОписаниеОповещения("ВводМаркиЗавершение", ЭтотОбъект, ДопПараметры);
			ПоказатьВводСтроки(ОповещениеМарки, "", "Введите акцизную марку (Украина):", 0, Ложь);
		Иначе
			// Обычный товар или режим возврата
			ДобавитьТоварВЧек(Результат, "", Штрихкод);
		КонецЕсли;
		
	КонецЕсли;
	
	АктивироватьПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура ВводМаркиЗавершение(Марка, ДопПараметры) Экспорт
	
	Если Марка = Неопределено ИЛИ ПустаяСтрока(Марка) Тогда
		ПоказатьПредупреждение(, "Отмена: Акцизная марка обязательна!");
		Возврат;
	КонецЕсли;
	
	// Здесь можно добавить Regex проверку формата марки (буквы/цифры)
	ДобавитьТоварВЧек(ДопПараметры.Результат, Марка, ДопПараметры.Штрихкод);
	АктивироватьПоиск();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыТовараНаСервере(Знач Номенклатура)
	Возврат Новый Структура("ТребуетАкцизнуюМарку", Номенклатура.ТребуетАкцизнуюМарку);
КонецФункции

&НаСервере
Функция ПолучитьФискальныйРежимНаСервере()
	Возврат НастройкиПоУмолчанию.ПолучитьФискальныйРежим();
КонецФункции

&НаСервере
Процедура ДобавитьТоварВЧек(Знач Номенклатура, Знач АкцизнаяМарка, Знач Штрихкод = "")
	
	// Проверяем наличие строки
	ПараметрыОтбора = Новый Структура("Номенклатура", Номенклатура);
	
	// Если есть марка - ищем строку именно с этой маркой (уникальность)
	Если ЗначениеЗаполнено(АкцизнаяМарка) Тогда
		ПараметрыОтбора.Вставить("АкцизнаяМарка", АкцизнаяМарка);
	КонецЕсли;
	
	НайденныеСтроки = Объект.ТЧ.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		// Увеличиваем количество (для акциза это редкость, но допустим)
		СтрокаТЧ = НайденныеСтроки[0];
		СтрокаТЧ.Количество = СтрокаТЧ.Количество + 1;
	Иначе
		// Новая строка
		СтрокаТЧ = Объект.ТЧ.Добавить();
		СтрокаТЧ.Номенклатура = Номенклатура;
		СтрокаТЧ.Количество = 1;
		СтрокаТЧ.Цена = ПолучитьЦенуНоменклатуры(Номенклатура);
		СтрокаТЧ.АкцизнаяМарка = АкцизнаяМарка;
		СтрокаТЧ.Штрихкод = Штрихкод;
	КонецЕсли;
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ЕСТЬNULL(Ц.Цена, 0) КАК Цена 
		|ИЗ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Д, Номенклатура=&Н) КАК Ц";
	Запрос.УстановитьПараметр("Д", ТекущаяДата());
	Запрос.УстановитьПараметр("Н", Номенклатура);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда Возврат Выб.Цена; КонецЕсли;
	Возврат 0;
КонецФункции

#КонецОбласти

#Область ДействияСТаблицейТоваров

&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	РассчитатьИтоги();   
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура ТЧКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.ТЧ.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество;
		РассчитатьИтоги();
	КонецЕсли;
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоги()
	// Если нужно обновлять подвалы или общую сумму формы
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Если Объект.ТЧ.Количество() = 0 Тогда Возврат; КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("УдалитьЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Очистить чек полностью?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗавершение(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТЧ.Очистить();
		РассчитатьИтоги();
	КонецЕсли;
	АктивироватьПоиск();
КонецПроцедуры

#КонецОбласти

#Область ОформлениеПродажи

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если Объект.ТЧ.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Чек пуст!");
		Возврат;
	КонецЕсли;
	
	// В зависимости от режима - продажа или возврат
	Если РежимРаботы = "Возврат" Тогда
		ОформитьВозврат();
	Иначе
		ОформитьПродажу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПродажу()
	
	// Проверяем настройку разделения фискальных чеков
	НастройкиРазделения = ПолучитьНастройкиРазделенияНаСервере();
	
	Если НастройкиРазделения.РазделениеВключено Тогда
		
		// Режим разделения: показываем вид оплаты (Наличные / Карта)
		СписокВидов = Новый СписокЗначений;
		СписокВидов.Добавить("Наличные", "Наличные");
		СписокВидов.Добавить("Карта", "Карта");
		
		Оп = Новый ОписаниеОповещения("ВыборВидаОплатыЗавершение", ЭтотОбъект, НастройкиРазделения);
		СписокВидов.ПоказатьВыборЭлемента(Оп, "Выберите вид оплаты:");
		
	Иначе
		
		// Стандартный режим: выбор кассы напрямую
		СписокКасс = ПолучитьДоступныеКассыДляРасчета();
		
		Если СписокКасс.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Нет доступных касс для расчета! Проверьте настройки справочника Кассы.");
			Возврат;
		КонецЕсли;
		
		Оп = Новый ОписаниеОповещения("ВыборОплатыЗавершение", ЭтотОбъект);
		СписокКасс.ПоказатьВыборЭлемента(Оп, "Выберите кассу для оплаты:");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаОплатыЗавершение(ВыбранныйЭлемент, НастройкиРазделения) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидОплаты = ВыбранныйЭлемент.Значение;
	
	// Определяем кассу по виду оплаты
	Если ВидОплаты = "Наличные" Тогда
		КассаОплаты = НастройкиРазделения.КассаНаличных;
	Иначе
		КассаОплаты = НастройкиРазделения.КассаБезналичных;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КассаОплаты) Тогда
		ПоказатьПредупреждение(, "Не настроена касса для вида оплаты """ + ВидОплаты + """! Откройте Управление настройками.");
		Возврат;
	КонецЕсли;
	
	// Для безналичной оплаты — подтверждение
	Если ВидОплаты = "Карта" Тогда
		
		ПараметрыОповещения = Новый Структура("КассаОплаты", КассаОплаты);
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеОплатыБанкомЗавершение", ЭтотОбъект, ПараметрыОповещения);
		
		СуммаЧека = 0;
		Для Каждого СтрТЧ Из Объект.ТЧ Цикл
			СуммаЧека = СуммаЧека + СтрТЧ.Сумма;
		КонецЦикла;
		
		ТекстВопроса = "Оплата картой (касса """ + Строка(КассаОплаты) + """)." 
			+ Символы.ПС + "Сумма к оплате: " + Формат(СуммаЧека, "ЧЦ=15; ЧДЦ=2")
			+ Символы.ПС + Символы.ПС + "Подтвердить оплату?";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Подтверждение оплаты");
		
	Иначе
		
		ВыполнитьОформлениеЧека(КассаОплаты);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиРазделенияНаСервере()
	
	Результат = Новый Структура;
	Результат.Вставить("РазделениеВключено", НастройкиПоУмолчанию.ПолучитьРазделениеФискальныхЧеков());
	Результат.Вставить("КассаНаличных", НастройкиПоУмолчанию.ПолучитьКассуНаличных());
	Результат.Вставить("КассаБезналичных", НастройкиПоУмолчанию.ПолучитьКассуБезналичных());
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОформитьВозврат()
	
	// Проверяем настройку разделения фискальных чеков
	НастройкиРазделения = ПолучитьНастройкиРазделенияНаСервере();
	
	Если НастройкиРазделения.РазделениеВключено Тогда
		
		// Режим разделения: показываем вид оплаты (Наличные / Карта)
		СписокВидов = Новый СписокЗначений;
		СписокВидов.Добавить("Наличные", "Наличные");
		СписокВидов.Добавить("Карта", "Карта");
		
		Оп = Новый ОписаниеОповещения("ВыборВидаВозвратаПоОплатеЗавершение", ЭтотОбъект, НастройкиРазделения);
		СписокВидов.ПоказатьВыборЭлемента(Оп, "Выберите вид возврата:");
		
	Иначе
		
		// Стандартный режим: Выбор кассы для возврата денежных средств
		СписокКасс = ПолучитьДоступныеКассыДляРасчета();
		
		Если СписокКасс.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Нет доступных касс для расчета! Проверьте настройки справочника Кассы.");
			Возврат;
		КонецЕсли;
		
		Оп = Новый ОписаниеОповещения("ВыборВидаВозвратаЗавершение", ЭтотОбъект);
		СписокКасс.ПоказатьВыборЭлемента(Оп, "Выберите кассу для возврата:");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаВозвратаПоОплатеЗавершение(ВыбранныйЭлемент, НастройкиРазделения) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидОплаты = ВыбранныйЭлемент.Значение;
	
	// Определяем кассу по виду оплаты
	Если ВидОплаты = "Наличные" Тогда
		КассаОплаты = НастройкиРазделения.КассаНаличных;
	Иначе
		КассаОплаты = НастройкиРазделения.КассаБезналичных;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КассаОплаты) Тогда
		ПоказатьПредупреждение(, "Не настроена касса для вида оплаты """ + ВидОплаты + """! Откройте Управление настройками.");
		Возврат;
	КонецЕсли;
	
	// Для безналичного возврата — подтверждение
	Если ВидОплаты = "Карта" Тогда
		
		ПараметрыОповещения = Новый Структура("КассаОплаты", КассаОплаты);
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеВозвратаБанкомЗавершение", ЭтотОбъект, ПараметрыОповещения);
		
		СуммаВозврата = 0;
		Для Каждого СтрТЧ Из Объект.ТЧ Цикл
			СуммаВозврата = СуммаВозврата + СтрТЧ.Сумма;
		КонецЦикла;
		
		ТекстВопроса = "Возврат через карту (касса """ + Строка(КассаОплаты) + """)." 
			+ Символы.ПС + "Сумма возврата: " + Формат(СуммаВозврата, "ЧЦ=15; ЧДЦ=2")
			+ Символы.ПС + Символы.ПС + "Подтвердить возврат?";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Подтверждение возврата");
		
	Иначе
		
		ВыполнитьОформлениеВозврата(КассаОплаты);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаВозвратаЗавершение(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	КассаОплаты = ВыбранныйЭлемент.Значение;
	
	// Проверяем вид кассы — банковский счет требует подтверждения
	ВидКассы = ПолучитьВидКассыНаСервере(КассаОплаты);
	
	Если ВидКассы = ПредопределенноеЗначение("Перечисление.ВидыКасс.БанковскийСчет") Тогда
		
		ПараметрыОповещения = Новый Структура("КассаОплаты", КассаОплаты);
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеВозвратаБанкомЗавершение", ЭтотОбъект, ПараметрыОповещения);
		
		СуммаВозврата = 0;
		Для Каждого СтрТЧ Из Объект.ТЧ Цикл
			СуммаВозврата = СуммаВозврата + СтрТЧ.Сумма;
		КонецЦикла;
		
		ТекстВопроса = "Возврат через банковский счет (касса """ + Строка(КассаОплаты) + """)." 
			+ Символы.ПС + "Сумма возврата: " + Формат(СуммаВозврата, "ЧЦ=15; ЧДЦ=2")
			+ Символы.ПС + Символы.ПС + "Подтвердить возврат?";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Подтверждение возврата");
		
	Иначе
		
		ВыполнитьОформлениеВозврата(КассаОплаты);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеВозвратаБанкомЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьОформлениеВозврата(ДополнительныеПараметры.КассаОплаты);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Возврат через банковский счет отменён.";
		Сообщение.Сообщить();
		АктивироватьПоиск();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОформлениеВозврата(КассаОплаты)
	
	// Вызов сервера для оформления возврата
	Если ОформитьВозвратНаСервере(КассаОплаты) Тогда
		ПоказатьПредупреждение(, "Возврат успешно оформлен!");
		Объект.ТЧ.Очистить();
		
		// Возвращаемся в режим продажи
		ЧекДляВозврата = Неопределено;
		РежимРаботы = "Продажа";
		ОбновитьОтображениеРежима();
		РассчитатьИтоги();
	КонецЕсли;
	
	АктивироватьПоиск();
	
КонецПроцедуры

&НаСервере
Функция ОформитьВозвратНаСервере(Знач КассаОплаты)
	
	// Проверяем фискальный режим
	ФискальныйРежимВкл = НастройкиПоУмолчанию.ПолучитьФискальныйРежим();
	
	Попытка
		НовыйВозврат = Документы.ВозвратТовараОтПокупателя.СоздатьДокумент();
		НовыйВозврат.Дата = ТекущаяДата();
		
		// Заполняем шапку
		НовыйВозврат.Склад = Склад;
		// Фискальный возврат только при включенном фискальном режиме
		
		// Заполняем товары
		Для Каждого СтрТЧ Из Объект.ТЧ Цикл
			НоваяСтр = НовыйВозврат.Товары.Добавить();
			НоваяСтр.Номенклатура = СтрТЧ.Номенклатура;
			НоваяСтр.Количество = СтрТЧ.Количество;
			НоваяСтр.Цена = СтрТЧ.Цена;
			НоваяСтр.Сумма = СтрТЧ.Сумма;
		КонецЦикла;
		
		НовыйВозврат.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
		
	Исключение
		Сообщить("Ошибка оформления возврата: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ВыборОплатыЗавершение(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	
	КассаОплаты = ВыбранныйЭлемент.Значение;
	
	// Проверяем вид кассы — банковский счет требует подтверждения
	ВидКассы = ПолучитьВидКассыНаСервере(КассаОплаты);
	
	Если ВидКассы = ПредопределенноеЗначение("Перечисление.ВидыКасс.БанковскийСчет") Тогда
		
		ПараметрыОповещения = Новый Структура("КассаОплаты", КассаОплаты);
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеОплатыБанкомЗавершение", ЭтотОбъект, ПараметрыОповещения);
		
		СуммаЧека = 0;
		Для Каждого СтрТЧ Из Объект.ТЧ Цикл
			СуммаЧека = СуммаЧека + СтрТЧ.Сумма;
		КонецЦикла;
		
		ТекстВопроса = "Оплата через банковский счет (касса """ + Строка(КассаОплаты) + """)." 
			+ Символы.ПС + "Сумма к оплате: " + Формат(СуммаЧека, "ЧЦ=15; ЧДЦ=2")
			+ Символы.ПС + Символы.ПС + "Подтвердить оплату?";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Подтверждение оплаты");
		
	Иначе
		
		ВыполнитьОформлениеЧека(КассаОплаты);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеОплатыБанкомЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьОформлениеЧека(ДополнительныеПараметры.КассаОплаты);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Оплата через банковский счет отменена.";
		Сообщение.Сообщить();
		АктивироватьПоиск();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОформлениеЧека(КассаОплаты)
	
	// Вызов сервера для проведения
	Если ОформитьЧекНаСервере(КассаОплаты) Тогда
		ПоказатьПредупреждение(, "Чек успешно пробит!");
		Объект.ТЧ.Очистить();
		РассчитатьИтоги();
	КонецЕсли;
	
	АктивироватьПоиск();
	
КонецПроцедуры

&НаСервере
Функция ОформитьЧекНаСервере(Знач КассаОплаты)
	
	// Проверяем фискальный режим для определения статуса
	ФискальныйРежимВкл = НастройкиПоУмолчанию.ПолучитьФискальныйРежим();
	
	Попытка
		НовыйЧек = Документы.ЧекККМ.СоздатьДокумент();
		НовыйЧек.Дата = ТекущаяДата();
		
		// Заполняем шапку из контекста формы
		НовыйЧек.Склад = Склад; 
		НовыйЧек.Касса = КассаОплаты; // Используем выбранную кассу вместо кассы по умолчанию
		НовыйЧек.КассоваяСмена = Объект.КассоваяСмена;
		
		// Устанавливаем статус в зависимости от фискального режима
		Если ФискальныйРежимВкл Тогда
			НовыйЧек.Статус = Перечисления.СтатусыЧекаККМ.Пробит; // Фискальный чек
		Иначе
			НовыйЧек.Статус = Перечисления.СтатусыЧекаККМ.Нефискальный; // Только внутренние движения
		КонецЕсли;
		
		СуммаДок = 0;
		Для Каждого СтрТЧ Из Объект.ТЧ Цикл
			НоваяСтр = НовыйЧек.Товары.Добавить();
			
			// Заполняем стандартные реквизиты
			НоваяСтр.Номенклатура = СтрТЧ.Номенклатура;
			НоваяСтр.Количество = СтрТЧ.Количество;
			НоваяСтр.Цена = СтрТЧ.Цена;
			НоваяСтр.Сумма = СтрТЧ.Сумма;
			
			// Важные поля: Налоговая группа и Марка
			НоваяСтр.НалоговаяГруппа = СтрТЧ.Номенклатура.НалоговаяГруппа;
			НоваяСтр.АкцизнаяМарка = СтрТЧ.АкцизнаяМарка;
			
			СуммаДок = СуммаДок + СтрТЧ.Сумма;
		КонецЦикла;
		
		НовыйЧек.СуммаДокумента = СуммаДок;
		
		// Заполняем оплату — касса, на которую зачисляются средства
		Оплата = НовыйЧек.Оплата.Добавить();
		Оплата.КассаОплаты = КассаОплаты;
		Оплата.Сумма = СуммаДок;
		
		// Определяем вид оплаты по виду кассы
		ВидКассы = КассаОплаты.ВидКассы;
		Если ВидКассы = Перечисления.ВидыКасс.БанковскийСчет Тогда
			Оплата.ВидОплаты = Перечисления.ВидыОплаты.Безналичные;
		Иначе
			Оплата.ВидОплаты = Перечисления.ВидыОплаты.Наличные;
		КонецЕсли;
		
		НовыйЧек.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
		
	Исключение
		Сообщить("Ошибка проведения: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступныеКассыДляРасчета()
	
	СписокКасс = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кассы.Ссылка КАК Ссылка,
		|	Кассы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Кассы КАК Кассы
		|ГДЕ
		|	НЕ Кассы.ПометкаУдаления
		|	И Кассы.ДоступнаПриРасчете = ИСТИНА
		|УПОРЯДОЧИТЬ ПО
		|	Кассы.Наименование";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокКасс.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокКасс;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидКассыНаСервере(Касса)
	
	Если Не ЗначениеЗаполнено(Касса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Касса.ВидКассы;
	
КонецФункции

&НаКлиенте
Процедура Поиск(Команда)
	
	// Создаем обработчик результата
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоискЗавершение", ЭтотОбъект);
	
	// Показываем диалог ввода штрихкода
	ПоказатьВводСтроки(ОписаниеОповещения, "", "Введите штрихкод");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискЗавершение(Штрихкод, ДополнительныеПараметры) Экспорт
	
	Если Штрихкод = Неопределено Или ПустаяСтрока(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	// Обрабатываем штрихкод как обычный поиск
	ОбработкаШтрихкода(Штрихкод);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьПолноэкранныйРежим(Команда)
	
	ПолноэкранныйРежим = Не ПолноэкранныйРежим;
	
	Если ПолноэкранныйРежим Тогда
		// Включаем полноэкранный режим - устанавливаем свойства формы
		АвтоМаксВысота = Истина;
		АвтоМаксШирина = Истина;
		
		// Обновляем текст кнопки
		Если Элементы.Найти("ПолноэкранныйРежим") <> Неопределено Тогда
			Элементы.ПолноэкранныйРежим.Заголовок = "Выход";
		КонецЕсли;
		
		ПоказатьПредупреждение(, "Форма развернута. Для выхода нажмите кнопку 'Выход' или клавишу F11");
	Иначе
		// Выключаем полноэкранный режим
		АвтоМаксВысота = Ложь;
		АвтоМаксШирина = Ложь;
		
		// Возвращаем стандартный текст кнопки
		Если Элементы.Найти("ПолноэкранныйРежим") <> Неопределено Тогда
			Элементы.ПолноэкранныйРежим.Заголовок = "Полный экран";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПанельБыстрыхТоваров
// (Оставляем старый код для панели без изменений)

&НаСервере
Процедура ЗагрузитьНастройкиПанелиИзРегистра()
	// Получаем настройки один раз при открытии формы
	КоличествоВРяду = НастройкиПоУмолчанию.ПолучитьКоличествоКнопокВРяду();
	КоличествоРядов = НастройкиПоУмолчанию.ПолучитьКоличествоКнопокВКолонке();
	ШиринаКнопок = НастройкиПоУмолчанию.ПолучитьШиринуКнопок();
	ВысотаКнопок = НастройкиПоУмолчанию.ПолучитьВысотуКнопок();
	
	// Если значения не установлены - используем значения по умолчанию
	Если КоличествоВРяду = Неопределено ИЛИ КоличествоВРяду = 0 Тогда
		КоличествоВРяду = 4;
	КонецЕсли;
	
	Если КоличествоРядов = Неопределено ИЛИ КоличествоРядов = 0 Тогда
		КоличествоРядов = 6;
	КонецЕсли;
	
	Если ШиринаКнопок = Неопределено ИЛИ ШиринаКнопок = 0 Тогда
		ШиринаКнопок = 100;
	КонецЕсли;
	
	Если ВысотаКнопок = Неопределено ИЛИ ВысотаКнопок = 0 Тогда
		ВысотаКнопок = 80;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиПанелиНаСервере()
	// Загружаем новые настройки из регистра
	ЗагрузитьНастройкиПанелиИзРегистра();
	
	// Пересоздаем группы рядов
	УдалитьГруппыРядов();
	СоздатьГруппыРядов();
	
	// Перерисовываем панель товаров с новыми размерами
	ОбновитьОтображениеНоменклатурыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияПанели(Элемент = Неопределено)
	Если Элементы.Найти("ГруппаВыборТовара") <> Неопределено Тогда
		// Toggle - переключение видимости панели товаров
		Элементы.ГруппаВыборТовара.Видимость = ПоказатьПанельТоваров;
	КонецЕсли;
	АктивироватьПоиск();
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппыРядов()
	Для ИндексРяда = 0 По КоличествоРядов - 1 Цикл
		ИмяГруппы = "ГруппаРяд" + Строка(ИндексРяда + 1);
		Если Элементы.Найти(ИмяГруппы) = Неопределено Тогда
			ГруппаРяда = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаВыборТовара);
			ГруппаРяда.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРяда.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаРяда.Отображение = ОтображениеОбычнойГруппы.Нет;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьГруппыРядов()
	
	// 1. Собираем элементы для удаления с сохранением имени команды
	МассивУдаления = Новый Массив;
	Для Каждого Элемент Из Элементы Цикл
		// Удаляем динамические кнопки и пустые декорации
		Если СтрНачинаетсяС(Элемент.Имя, "Бтн_CMD_") ИЛИ СтрНачинаетсяС(Элемент.Имя, "Пустая_") Тогда
			// Безопасно получаем имя команды
			Попытка
				ИмяКомандыЭлемента = Элемент.ИмяКоманды;
			Исключение
				ИмяКомандыЭлемента = "";
			КонецПопытки;
			
			// Сохраняем элемент И имя его команды в структуре
			ИнфоЭлемента = Новый Структура("Элемент, ИмяКоманды", Элемент, ИмяКомандыЭлемента);
			МассивУдаления.Добавить(ИнфоЭлемента);
		КонецЕсли;
	КонецЦикла;
	
	// 2. Удаляем
	Для Каждого ИнфоЭл Из МассивУдаления Цикл
		
		// ВАЖНО: Сначала удаляем Элемент формы (Кнопку/Декорацию)
		Попытка
			Элементы.Удалить(ИнфоЭл.Элемент);
		Исключение
			// Игнорируем ошибки - элемент уже удален или недоступен
			Продолжить;
		КонецПопытки;
		
		// ВАЖНО: Только потом удаляем связанную Команду (если есть)
		Если ЗначениеЗаполнено(ИнфоЭл.ИмяКоманды) Тогда
			Попытка
				Команды.Удалить(Команды[ИнфоЭл.ИмяКоманды]); 
			Исключение
				// Игнорируем ошибки - команда уже удалена
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработчикУправлениеПанелиТоваров(Действие)
	// Вызываем серверную функцию для обработки навигации
	Результат = ОбработатьНавигациюНаСервере(Действие);
	
	// Обновляем отображение если требуется
	Если Результат.Перерисовать Тогда 
		ОбновитьОтображениеНоменклатурыНаСервере(); 
		НомерСтраницы = НомерСтраницыПараметр; // Обновляем отображение номера страницы
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбработатьНавигациюНаСервере(Действие)
	Перерисовать = Ложь;
	
	Если Действие = "ПриОткрытии" ИЛИ Действие = "Группа" Тогда
		// Инициализация или переход в группу - сброс на первую страницу
		НомерСтраницыПараметр = 1; 
		Перерисовать = Истина;
		
	ИначеЕсли Действие = "СледующаяСтраница" Тогда
		// Проверка: нельзя листать вперед на страницу без товаров
		КоличествоНаСтраницу = КоличествоВРяду * КоличествоРядов;
		ВсегоТоваров = ПолучитьКоличествоТоваровВГруппе(ТекущаяГруппа);
		МаксСтраница = Цел((ВсегоТоваров - 1) / КоличествоНаСтраницу) + 1;
		
		Если НомерСтраницыПараметр < МаксСтраница Тогда
			НомерСтраницыПараметр = НомерСтраницыПараметр + 1; 
			Перерисовать = Истина;
		КонецЕсли;
		
	ИначеЕсли Действие = "ПредыдущаяСтраница" Тогда
		// Проверка: нельзя листать назад на 0 страницу
		Если НомерСтраницыПараметр > 1 Тогда 
			НомерСтраницыПараметр = НомерСтраницыПараметр - 1; 
			Перерисовать = Истина; 
		КонецЕсли;
		
	ИначеЕсли Действие = "Назад" Тогда
		// Возврат к родительской группе
		Если ЗначениеЗаполнено(ТекущаяГруппа) Тогда
			ТекущаяГруппа = ТекущаяГруппа.Родитель; 
			НомерСтраницыПараметр = 1; 
			Перерисовать = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("Перерисовать", Перерисовать);
КонецФункции

&НаСервере
Процедура ОбновитьОтображениеНоменклатурыНаСервере()
	УдалитьГруппыРядов(); // Упрощенная очистка
	
	КоличествоНаСтраницу = КоличествоВРяду * КоличествоРядов;
	МассивТоваров = ПолучитьТоварыДляПанели(ТекущаяГруппа, НомерСтраницыПараметр, КоличествоНаСтраницу);
	
	Счетчик = 0;
	Для Каждого СтруктураТовара Из МассивТоваров Цикл
		Счетчик = Счетчик + 1;
		ИндексРяда = Цел((Счетчик - 1) / КоличествоВРяду);
		ИмяГруппы = "ГруппаРяд" + Строка(ИндексРяда + 1);
		ГруппаРодитель = Элементы.Найти(ИмяГруппы);
		
		Если ГруппаРодитель <> Неопределено Тогда
			ЧистыйКод = СтрЗаменить(СтруктураТовара.Код, " ", "");
			ЧистыйКод = СтрЗаменить(ЧистыйКод, "-", "_");
			УИД = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			
			Префикс = ?(СтруктураТовара.ЭтоГруппа, "GRP", "ITM");
			ИмяКоманды = "CMD_" + Префикс + "_" + ЧистыйКод + "_" + УИД;
			ИмяКнопки  = "Бтн_" + ИмяКоманды;
			
			Команда = Команды.Добавить(ИмяКоманды);
			Команда.Заголовок = ПреобразоватьТекстДляКнопки(СтруктураТовара.Наименование, 18, 3);
			Команда.Действие  = "НажатиеКнопкиТовара"; 
			
			Кнопка = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаРодитель);
			Кнопка.ИмяКоманды = ИмяКоманды;
			Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			Кнопка.Высота = ВысотаКнопок ;
			Кнопка.Ширина = ШиринаКнопок ;
			Кнопка.АвтоМаксимальнаяШирина = Ложь;
			Кнопка.РастягиватьПоГоризонтали = Ложь; // Не растягиваться по ширине
			Кнопка.РастягиватьПоВертикали = Ложь;   // Не растягиваться по высоте
			Кнопка.АвтоМаксимальнаяВысота = Ложь;
			
			Если СтруктураТовара.ЭтоГруппа Тогда Кнопка.ЦветФона = WebЦвета.СветлоЖелтый; КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Заполняем пустые ячейки для стабильности размера панели
	Пока Счетчик < КоличествоНаСтраницу Цикл
		Счетчик = Счетчик + 1;
		ИндексРяда = Цел((Счетчик - 1) / КоличествоВРяду);
		ИмяГруппы = "ГруппаРяд" + Строка(ИндексРяда + 1);
		ГруппаРодитель = Элементы.Найти(ИмяГруппы);
		
		Если ГруппаРодитель <> Неопределено Тогда
			// Добавляем пустую декорацию для заполнения ячейки
			ИмяДекорации = "Пустая_" + Строка(Счетчик) + "_" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			Декорация = Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), ГруппаРодитель);
			Декорация.Вид = ВидДекорацииФормы.Надпись;
			Декорация.Высота = ВысотаКнопок / 27; // Преобразование из пиксели в условные единицы формы
			Декорация.Ширина = ШиринаКнопок / 7;  // Преобразование из пиксели в условные единицы формы
			Декорация.Заголовок = "";
			Декорация.Видимость = Ложь; // Невидимая, но занимает место
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыДляПанели(Родитель, Страница, РазмерСтраницы)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|   Номенклатура.Ссылка КАК Ссылка, 
		|   Номенклатура.Код КАК Код, 
		|   Номенклатура.Наименование КАК Наименование, 
		|   Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ Справочник.Номенклатура КАК Номенклатура
		|ГДЕ Номенклатура.Родитель = &Родитель И НЕ Номенклатура.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО ЭтоГруппа УБЫВ, Наименование";
	Запрос.УстановитьПараметр("Родитель", ?(ЗначениеЗаполнено(Родитель), Родитель, Справочники.Номенклатура.ПустаяСсылка()));
	
	Результат = Запрос.Выполнить();
	МассивРезультат = Новый Массив;
	Начало = (Страница - 1) * РазмерСтраницы; 
	Конец = Начало + РазмерСтраницы;
	
	// Сохраняем общее количество для проверки возможности перелистывания
	ВсегоТоваровВГруппе = Результат.Выгрузить().Количество();
	
	Счетчик = 0; 
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Счетчик >= Начало И Счетчик < Конец Тогда
			МассивРезультат.Добавить(Новый Структура("Ссылка, Код, Наименование, ЭтоГруппа", 
				Выборка.Ссылка, Выборка.Код, Выборка.Наименование, Выборка.ЭтоГруппа));
		КонецЕсли;
		Счетчик = Счетчик + 1;
		Если Счетчик >= Конец Тогда Прервать; КонецЕсли;
	КонецЦикла;
	Возврат МассивРезультат;
КонецФункции

&НаСервере
Функция ПреобразоватьТекстДляКнопки(ИсходныйТекст, Ширина = 18, Высота = 3)
	// Преобразует текст с переносом по словам для отображения на кнопках
	// Вычисляет максимальное количество символов на основе размера кнопки
	// Ширина и Высота - размеры кнопки в условных единицах
	
	Если ПустаяСтрока(ИсходныйТекст) Тогда
		Возврат ИсходныйТекст;
	КонецЕсли;
	
	// Вычисляем максимум символов на одной строке на основе ширины
	// 1 условная единица ширины = примерно 1 символ в среднем
	// Вычитаем небольшой запас для отступов и скобок
	МаксимумСимволов = Цел(Ширина * 1.0) - 2;
	
	// Если максимум слишком мал, используем минимум 10 символов
	Если МаксимумСимволов < 10 Тогда
		МаксимумСимволов = 10;
	КонецЕсли;
	
	МассивСлов = СтрРазделить(ИсходныйТекст, " ");
	МассивСтрок = Новый Массив;
	ТекущаяСтрока = "";
	
	Для Каждого Слово Из МассивСлов Цикл
		// Если текущая строка + слово + пробел влезает в лимит
		Если СтрДлина(ТекущаяСтрока) + СтрДлина(Слово) + 1 <= МаксимумСимволов Тогда
			Если ПустаяСтрока(ТекущаяСтрока) Тогда
				ТекущаяСтрока = Слово;
			Иначе
				ТекущаяСтрока = ТекущаяСтрока + " " + Слово;
			КонецЕсли;
		Иначе
			// Если строка не пуста - добавляем её в массив
			Если НЕ ПустаяСтрока(ТекущаяСтрока) Тогда
				МассивСтрок.Добавить(ТекущаяСтрока);
			КонецЕсли;
			// Начинаем новую строку со слова
			ТекущаяСтрока = Слово;
		КонецЕсли;
	КонецЦикла;
	
	// Добавляем последнюю строку
	Если НЕ ПустаяСтрока(ТекущаяСтрока) Тогда
		МассивСтрок.Добавить(ТекущаяСтрока);
	КонецЕсли;
	
	// Объединяем строки с символом перевода строки (Символ(10))
	Возврат СтрСоединить(МассивСтрок, Символ(10));
КонецФункции

&НаСервере
Функция ПолучитьКоличествоТоваровВГруппе(Родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ Справочник.Номенклатура КАК Номенклатура
		|ГДЕ Номенклатура.Родитель = &Родитель И НЕ Номенклатура.ПометкаУдаления";
	Запрос.УстановитьПараметр("Родитель", ?(ЗначениеЗаполнено(Родитель), Родитель, Справочники.Номенклатура.ПустаяСсылка()));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура НажатиеКнопкиТовара(Команда)
	// Формат имени команды: CMD_<ТИП>_<КОД>_<УИД>
	МассивЧастей = СтрРазделить(Команда.Имя, "_");
	Если МассивЧастей.Количество() < 3 Тогда 
		Возврат; 
	КонецЕсли;
	
	ТипОбъекта = МассивЧастей[1]; // GRP или ITM
	КодОбъекта = МассивЧастей[2];
	
	Если ТипОбъекта = "GRP" Тогда
		// Переход в группу: очищаем панель, отображаем содержимое группы
		ПерейтиВГруппуНаСервере(КодОбъекта);
		ОбработчикУправлениеПанелиТоваров("Группа");
	Иначе
		// Добавление товара в ТЧ
		ДобавитьТоварИзПанели(КодОбъекта);
	КонецЕсли;
	АктивироватьПоиск();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварИзПанели(КодТовара)
	// Получаем информацию о товаре
	ИнфоТовара = ПолучитьИнфоТовараПоКоду(КодТовара);
	
	Если Не ИнфоТовара.Найден Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем фискальный режим
	ФискальныйРежимВкл = ПолучитьФискальныйРежимНаСервере();
	
	// В режиме возврата или при выключенном фискальном режиме акцизные марки не запрашиваются
	Если ИнфоТовара.ТребуетАкцизнуюМарку И РежимРаботы <> "Возврат" И ФискальныйРежимВкл Тогда
		// Сохраняем ссылку и запрашиваем марку асинхронно
		ТоварДляАкциза = ИнфоТовара.Ссылка;
		ОповещениеМарки = Новый ОписаниеОповещения("ВводМаркиПанелиЗавершение", ЭтотОбъект);
		ПоказатьВводСтроки(ОповещениеМарки, "", "Введите акцизную марку:", 0, Ложь);
	Иначе
		// Обычный товар или режим возврата - добавляем сразу
		ДобавитьТоварВЧекПоСсылке(ИнфоТовара.Ссылка, "");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВводМаркиПанелиЗавершение(Марка, ДопПараметры) Экспорт
	Если Марка = Неопределено ИЛИ ПустаяСтрока(Марка) Тогда
		ПоказатьПредупреждение(, "Отмена: Акцизная марка обязательна!");
		ТоварДляАкциза = Неопределено;
		Возврат;
	КонецЕсли;
	
	ДобавитьТоварВЧекПоСсылке(ТоварДляАкциза, Марка);
	ТоварДляАкциза = Неопределено;
	АктивироватьПоиск();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнфоТовараПоКоду(Знач КодТовара)
	Результат = Новый Структура("Найден, Ссылка, ТребуетАкцизнуюМарку", Ложь, Неопределено, Ложь);
	
	НайденныйТовар = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
	Если НайденныйТовар.Пустая() ИЛИ НайденныйТовар.ЭтоГруппа Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Найден = Истина;
	Результат.Ссылка = НайденныйТовар;
	Результат.ТребуетАкцизнуюМарку = НайденныйТовар.ТребуетАкцизнуюМарку;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ДобавитьТоварВЧекПоСсылке(Знач Номенклатура, Знач АкцизнаяМарка)
	ДобавитьТоварВЧек(Номенклатура, АкцизнаяМарка, "");
КонецПроцедуры

&НаСервере
Процедура ПерейтиВГруппуНаСервере(Знач КодГруппы)
	НайденнаяГруппа = Справочники.Номенклатура.НайтиПоКоду(КодГруппы);
	Если Не НайденнаяГруппа.Пустая() И НайденнаяГруппа.ЭтоГруппа Тогда 
		ТекущаяГруппа = НайденнаяГруппа; 
		НомерСтраницыПараметр = 1;
	КонецЕсли;
КонецПроцедуры

// Команды навигации по панели товаров
//
// Параметры:
//  Команда - КомандаФормы
//
&НаКлиенте
Процедура Назад(Команда)
	ОбработчикУправлениеПанелиТоваров("Назад"); 
	АктивироватьПоиск(); 
КонецПроцедуры

// Параметры:
//  Команда - КомандаФормы
//
&НаКлиенте
Процедура СледующаяСтраница(Команда) 
	ОбработчикУправлениеПанелиТоваров("СледующаяСтраница"); 
	АктивироватьПоиск(); 
КонецПроцедуры

// Параметры:
//  Команда - КомандаФормы
//
&НаКлиенте
Процедура ПредыдущаяСтраница(Команда) 
	ОбработчикУправлениеПанелиТоваров("ПредыдущаяСтраница"); 
	АктивироватьПоиск(); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьСкладНаСервере()
	
	// Получаем склад из регистра настроек по умолчанию (один раз при открытии)
	Склад = НастройкиПоУмолчанию.ПолучитьОсновнойСклад();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладРозница()
	
	// Возвращаем склад из настроек по умолчанию
	Возврат НастройкиПоУмолчанию.ПолучитьОсновнойСклад();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНастройки(Команда)
	// Обновляем настройки панели из регистра и пересоздаем визуальное представление
	ОбновитьНастройкиПанелиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуКоманда(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
		ПоказатьПредупреждение(, "Нет активной смены!");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Закрыть текущую смену? Это действие нельзя отменить." + Символы.ПС + 
		"После закрытия необходимо будет открыть новую смену для продолжения работы.";
	Оповещение = Новый ОписаниеОповещения("ЗакрытьСменуПослеПодтверждения", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСменуПослеПодтверждения(Результат, ДопПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗакрытьСменуНаСервере();
		ПоказатьОповещениеПользователя("Смена закрыта", , "Кассовая смена успешно закрыта. Откройте новую смену для продолжения работы.");
		
		// Предлагаем открыть новую смену
		ТекстВопроса = "Открыть новую смену для продолжения работы?";
		Оповещение = Новый ОписаниеОповещения("ОткрытьНовуюСменуПослеЗакрытия", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Исключение
		ПоказатьПредупреждение(, "Ошибка при закрытии смены: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовуюСменуПослеЗакрытия(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПроверитьИОткрытьСменуНаСервере();
	Иначе
		// Закрываем РМК
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПереключитьВРежимВозврата(Команда)
	
	// Если уже в режиме возврата, игнорируем
	Если РежимРаботы = "Возврат" Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, есть ли товары в чеке
	Если Объект.ТЧ.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПереключитьВРежимВозвратаПродолжение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "В чеке есть товары. Очистить чек перед переключением в режим возврата?", РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	// Показываем выбор режима возврата
	Ждать ВыбратьРежимВозврата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьВРежимВозвратаПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТЧ.Очистить();
		ВыбратьРежимВозвратаАсинх();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		// Переключаемся без очистки - нельзя
		ПоказатьПредупреждение(, "Для переключения в режим возврата необходимо очистить чек!");
	КонецЕсли;
	// При "Отмена" - ничего не делаем
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьРежимВозвратаАсинх()
	Ждать ВыбратьРежимВозврата();
КонецПроцедуры

&НаКлиенте
Асинх Функция ВыбратьРежимВозврата()
	
	// Показываем список выбора режима возврата
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("СвободныйВозврат", "Свободный возврат (ручной ввод товаров)");
	СписокВыбора.Добавить("ПоЧеку", "Возврат по чеку (выбор из списка чеков)");
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораРежимаВозврата", ЭтотОбъект);
	СписокВыбора.ПоказатьВыборЭлемента(Оповещение, "Выберите режим возврата:");
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Асинх Процедура ОбработкаВыбораРежимаВозврата(ВыбранныйЭлемент, ДопПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "ПоЧеку" Тогда
		// Открываем форму выбора чека с оповещением
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("Склад", Склад);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЧека", ЭтотОбъект);
		ОткрытьФорму("Документ.ЧекККМ.Форма.ФормаВыбораЧека", ПараметрыФормы, ЭтотОбъект, , , , Оповещение);
	ИначеЕсли ВыбранныйЭлемент.Значение = "СвободныйВозврат" Тогда
		// Свободный возврат - просто переключаем режим
		ЧекДляВозврата = Неопределено;
		РежимРаботы = "Возврат";
		ОбновитьОтображениеРежима();
		ПоказатьПредупреждение(, "Режим возврата активирован. Добавляйте товары для возврата.");
	КонецЕсли;
	
	АктивироватьПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЧека(ВыбранныйЧек, ДопПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныйЧек) = Тип("ДокументСсылка.ЧекККМ") Тогда
		// Заполняем ТЧ на основании выбранного чека
		ЧекДляВозврата = ВыбранныйЧек;
		ЗаполнитьТЧИзЧекаНаСервере(ВыбранныйЧек);
		РежимРаботы = "Возврат";
		ОбновитьОтображениеРежима();
		РассчитатьИтоги();
	КонецЕсли;
	
	АктивироватьПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьВРежимПродажи(Команда)
	
	// Если уже в режиме продажи, игнорируем
	Если РежимРаботы = "Продажа" Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, есть ли товары в чеке
	Если Объект.ТЧ.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПереключитьВРежимПродажиПродолжение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "В чеке есть товары для возврата. Очистить и переключиться в режим продажи?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	// Переключаемся сразу
	ЧекДляВозврата = Неопределено;
	РежимРаботы = "Продажа";
	ОбновитьОтображениеРежима();
	АктивироватьПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьВРежимПродажиПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТЧ.Очистить();
		ЧекДляВозврата = Неопределено;
		РежимРаботы = "Продажа";
		ОбновитьОтображениеРежима();
	КонецЕсли;
	
	АктивироватьПоиск();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеРежима()
	
	// Проверяем фискальный режим
	ФискальныйРежимВкл = ПолучитьФискальныйРежимНаСервере();
	
	// Меняем заголовок формы в зависимости от режима
	Если РежимРаботы = "Возврат" Тогда
		Заголовок = "РМК - РЕЖИМ ВОЗВРАТА";
		НадписьРежимРаботы = "РЕЖИМ: ВОЗВРАТ";
		
		// Меняем заголовок кнопки "Рассчитать" на "Оформить возврат"
		Если Элементы.Найти("Рассчитать") <> Неопределено Тогда
			Элементы.Рассчитать.Заголовок = "ОФОРМИТЬ ВОЗВРАТ";
			Элементы.Рассчитать.ЦветФона = WebЦвета.Томатный;
		КонецЕсли;
		
		// Скрываем кнопку "Возврат", показываем "Продажа"
		Если Элементы.Найти("Возврат") <> Неопределено Тогда
			Элементы.Возврат.Видимость = Ложь;
		КонецЕсли;
		
		Если Элементы.Найти("Продажа") <> Неопределено Тогда
			Элементы.Продажа.Видимость = Истина;
		КонецЕсли;
		
		// Меняем цвет для визуального отличия
		Если Элементы.Найти("ИтогСумма") <> Неопределено Тогда
			Элементы.ИтогСумма.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
		
		// Устанавливаем цвет надписи режима
		Если Элементы.Найти("НадписьРежимРаботы") <> Неопределено Тогда
			Элементы.НадписьРежимРаботы.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
		
		// Отключаем поле акцизной марки в режиме возврата или без фискализации
		Если Элементы.Найти("ТЧАкцизнаяМарка") <> Неопределено Тогда
			Элементы.ТЧАкцизнаяМарка.ТолькоПросмотр = Истина;
			Элементы.ТЧАкцизнаяМарка.Видимость = Ложь; // Скрываем поле
			Элементы.ТЧАкцизнаяМарка.ЦветФона = WebЦвета.СветлоСерый;
		КонецЕсли;
		
	Иначе
		Заголовок = "Рабочее место кассира";
		НадписьРежимРаботы = "РЕЖИМ: ПРОДАЖА";
		
		// Возвращаем стандартный заголовок кнопки
		Если Элементы.Найти("Рассчитать") <> Неопределено Тогда
			Элементы.Рассчитать.Заголовок = "РАССЧИТАТЬ";
			Элементы.Рассчитать.ЦветФона = Новый Цвет; // Сброс цвета
		КонецЕсли;
		
		// Показываем кнопку "Возврат", скрываем "Продажа"
		Если Элементы.Найти("Возврат") <> Неопределено Тогда
			Элементы.Возврат.Видимость = Истина;
		КонецЕсли;
		
		Если Элементы.Найти("Продажа") <> Неопределено Тогда
			Элементы.Продажа.Видимость = Ложь;
		КонецЕсли;
		
		// Возвращаем стандартный цвет
		Если Элементы.Найти("ИтогСумма") <> Неопределено Тогда
			Элементы.ИтогСумма.ЦветТекста = Новый Цвет;
		КонецЕсли;
		
		// Устанавливаем зеленый цвет для режима продажи
		Если Элементы.Найти("НадписьРежимРаботы") <> Неопределено Тогда
			Элементы.НадписьРежимРаботы.ЦветТекста = WebЦвета.Зеленый;
		КонецЕсли;
		
		// Включаем поле акцизной марки в режиме продажи с фискализацией
		Если Элементы.Найти("ТЧАкцизнаяМарка") <> Неопределено Тогда
			Если ФискальныйРежимВкл Тогда
				Элементы.ТЧАкцизнаяМарка.ТолькоПросмотр = Ложь;
				Элементы.ТЧАкцизнаяМарка.Видимость = Истина; // Показываем поле
				Элементы.ТЧАкцизнаяМарка.ЦветФона = Новый Цвет; // Сброс цвета
			Иначе
				// Скрываем поле в нефискальном режиме
				Элементы.ТЧАкцизнаяМарка.ТолькоПросмотр = Истина;
				Элементы.ТЧАкцизнаяМарка.Видимость = Ложь; // Скрываем поле
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧИзЧекаНаСервере(Знач ЧекСсылка)
	
	// Очищаем текущую ТЧ
	Объект.ТЧ.Очистить();
	
	// Загружаем товары из чека
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМТовары.Номенклатура КАК Номенклатура,
		|	ЧекККМТовары.Количество КАК Количество,
		|	ЧекККМТовары.Цена КАК Цена,
		|	ЧекККМТовары.Сумма КАК Сумма,
		|	ЧекККМТовары.АкцизнаяМарка КАК АкцизнаяМарка
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка = &Чек";
	
	Запрос.УстановитьПараметр("Чек", ЧекСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ТЧ.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Количество = Выборка.Количество;
		НоваяСтрока.Цена = Выборка.Цена;
		НоваяСтрока.Сумма = Выборка.Сумма;
		НоваяСтрока.АкцизнаяМарка = Выборка.АкцизнаяМарка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
